src/InformationRegisters/ПроизводственныйКалендарь/ПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроизводственныйКалендарь</name>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейКалендаря</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>МетодРасчета</name>
    <type>
      <types>EnumRef.МетодыРасчетаСебестомости</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыДнейКалендаря/ВидыДнейКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДнейКалендаря</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ОбщегоНазначенияСервер/Module.bsl
Функция ДобавитьКДатеКалендарныеДни(ИсходнаяДата, КоличествоДней) Экспорт
	
	Результат = Неопределено;
	Счетчик = 0;
	ВыборкаКалендарь = РегистрыСведений.ПроизводственныйКалендарь.Выбрать();
	Пока ВыборкаКалендарь.Следующий() Цикл
		
		Если ВыборкаКалендарь.Дата <= ИсходнаяДата Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ВыборкаКалендарь.ВидДня = Перечисления.ВидыДнейКалендаря.Рабочий Тогда
			Счетчик = Счетчик + 1;	
		КонецЕсли; 
		
		Если Счетчик = КоличествоДней Тогда
			Результат = ВыборкаКалендарь.Дата;
			Прервать;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Результат;

КонецФункции

Функция КоличествоЭлементов(ИмяСправочника) Экспорт
	
	//проверка наличия справочника в конфигурации
	РезультатПоиска = Метаданные.Справочники.Найти(ИмяСправочника);
	
	Если РезультатПоиска <> Неопределено Тогда
		
		Количество = 0;
		Выборка = Справочники[ИмяСправочника].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ПометкаУдаления = Ложь Тогда
				Количество = Количество + 1;
			КонецЕсли; 	
		КонецЦикла; 
		
	Иначе
		Количество = Неопределено;	
	КонецЕсли; 
	
		
	Возврат Количество;

КонецФункции

Функция ПолучитьУчетнуюПолитикуОрганизации(Дата, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаСрезПоследних.МетодРасчета КАК МетодРасчета
		|ИЗ
		|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&Дата, Организация = &Организация) КАК УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		МетодРасчета = Выборка.МетодРасчета;

	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для организации " + Организация + " не установлена учетная политика";
		Сообщение.Сообщить();
		
		МетодРасчета = Неопределено;
		
	КонецЕсли;   
	
	Возврат МетодРасчета;

КонецФункции
